Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Default implementation returns false.
zh_cn: 默认实现返回 false。

source: Default text alignment.
zh_cn: 默认文本对齐方式。

source: Default values will generally produce a reasonable spacing between components but values may change between different releases of the platform.
zh_cn: 默认值通常会在组件之间产生合理的间距，但值可能会在平台的不同版本之间发生变化。

source: Defaults to START and TOP.
zh_cn: 默认为 START 和 TOP。

source: Defaults to false.
zh_cn: 默认为 false。

source: Defensive cleanup for new gesture
zh_cn: 新手势的防御性清理

source: Define Custom Attributes
zh_cn: 定义自定义属性

source: Define Fields in Standard Places
zh_cn: 在标准位置定义字段

source: Define a Button in the layout file and assign it a unique ID.
zh_cn: 在布局中定义一个 Button，并给它申明一个唯一的 ID。

source: Define a shape by adding lines and curves to a Path object, then draw the shape using drawPath().
zh_cn: 通过将线和曲线添加到 Path 对象来定义形状，然后使用 drawPath() 绘制形状。

source: Define custom attributes for your view in a <declare-styleable> resource element
zh_cn: 在 <declare-styleable> 资源元素中为 view 定义自定义属性

source: Define fields either at the top of the file or immediately before the methods that use them.
zh_cn: 在文件的顶部或者在使用它们的方法之前定义字段。

source: Define gradient fills by creating LinearGradient objects.
zh_cn: 通过创建 LinearGradient 对象来定义渐变填充。

source: Define how the widget horizontal dimension is handled when set to MATCH_CONSTRAINT
zh_cn: 定义设置为 MATCH_CONSTRAINT 时部件的水平尺寸的处理方式。

source: Define how the widget vertical dimension is handled when set to MATCH_CONSTRAINT
zh_cn: 定义设置为 MATCH_CONSTRAINT 时部件的垂直尺寸的处理方式。

source: Define the order of appearance for two views, either vertically or horizontally.
zh_cn: 定义两个 view 的垂直或水平出现的顺序。

source: Defines an id that is not set.
zh_cn: 定义一个未设置的 id。

source: Defines how columns should stretch to fill the available empty space, if any.
zh_cn: 定义列应如何拉伸以填充可用空白区域(如果有)。

source: Defines how many columns to show.
zh_cn: 定义要显示的列数。

source: Defines how the indeterminate mode should behave when the progress reaches max.
zh_cn: 定义进度达到最大值时不确定模式的行为方式。

source: Defines if the associated drawables need to be mirrored when in RTL mode.
zh_cn: 定义在 RTL 模式下是否需要镜像关联的 drawable。

source: Defines text displayed in a small popup window on hover or long press.
zh_cn: 定义在悬停或长按时在小弹出窗口中显示的文本。

source: Defines text that briefly describes content of the view.
zh_cn: 定义简要描述 view 内容的文本。

source: Defines the alignment of the text.
zh_cn: 定义文本的对齐方式。

source: Defines the choice behavior for the view.
zh_cn: 定义 view 的选择行为。

source: Defines the default attached CoordinatorLayout.Behavior of a View class
zh_cn: 定义 View 类的默认附加 CoordinatorLayout.Behavior

source: Defines the default horizontal spacing between columns.
zh_cn: 定义列之间的默认水平间距。

source: Defines the default progress value, between 0 and max.
zh_cn: 定义默认进度值，介于 0 和最大值之间。

source: Defines the default vertical spacing between rows.
zh_cn: 定义行之间的默认垂直间距。

source: Defines the delay in milliseconds that a scrollbar takes to fade out.
zh_cn: 定义滚动条淡出所用的延迟(以毫秒为单位)。

source: Defines the delay in milliseconds that a scrollbar waits before fade out.
zh_cn: 定义滚动条在淡出之前等待的延迟(以毫秒为单位)。

source: Defines the direction of layout drawing.
zh_cn: 定义布局绘制的方向。

source: Defines the direction of the text.
zh_cn: 定义文本的方向。

source: Defines the drawable to draw over the content.
zh_cn: 定义绘制在内容之上的 drawable。

source: Defines the gravity to apply to the foreground drawable.
zh_cn: 定义要应用于前景 drawable 的 gravity。

source: Defines the hint displayed in the drop down menu.
zh_cn: 定义下拉菜单中显示的提示。

source: Defines the hint view displayed in the drop down menu.
zh_cn: 定义下拉菜单中显示的提示 view。

source: Defines the horizontal scrollbar thumb drawable.
zh_cn: 定义水平滚动条 thumb drawable。

source: Defines the horizontal scrollbar track drawable.
zh_cn: 定义水平滚动条轨道 drawable。

source: Defines the layout animation to use the first time the ViewGroup is laid out.
zh_cn: 定义在第一次布置 ViewGroup 时使用的布局动画。

source: Defines the layout mode of this ViewGroup.
zh_cn: 定义此 ViewGroup 的布局模式。

source: Defines the length of the fading edges.
zh_cn: 定义渐变边缘的长度。

source: Defines the look of the widget.
zh_cn: 定义小部件的外观。

source: Defines the maximum value.
zh_cn: 定义最大值。

source: Defines the maximum weight sum.
zh_cn: 定义最大权重总和。

source: Defines the minimum height of the view.
zh_cn: 定义 view 的最小高度。

source: Defines the minimum value.
zh_cn: 定义最小值。

source: Defines the minimum width of the view.
zh_cn: 定义 view 的最小宽度。

source: Defines the next keyboard navigation cluster.
zh_cn: 定义下一个键盘导航集群。

source: Defines the next view to give focus to when the next focus is View.FOCUS_DOWN If the reference refers to a view that does not exist or is part of a hierarchy that is invisible, a RuntimeException will result when the reference is accessed.
zh_cn: 定义下一个 view，以便在下一个焦点为 View.FOCUS_DOWN 如果引用引用的 view 不存在或者是不可见的层次结构的一部分，访问引用时将产生 RuntimeException。

source: Defines the next view to give focus to when the next focus is View.FOCUS_FORWARD If the reference refers to a view that does not exist or is part of a hierarchy that is invisible, a RuntimeException will result when the reference is accessed.
zh_cn: 定义下一个 view，以便在下一个焦点为 View.FOCUS_FORWARD 如果引用引用的 view 不存在或者是不可见的层次结构的一部分，访问引用时将产生 RuntimeException。

source: Defines the next view to give focus to when the next focus is View.FOCUS_LEFT.
zh_cn: 定义下一个 view，以便在下一个焦点为 View.FOCUS_LEFT 时提供焦点。

source: Defines the next view to give focus to when the next focus is View.FOCUS_RIGHT If the reference refers to a view that does not exist or is part of a hierarchy that is invisible, a RuntimeException will result when the reference is accessed.
zh_cn: 定义下一个 view，以便在下一个焦点为 View.FOCUS_RIGHT 如果引用引用不存在的 view 或者是不可见的层次结构的一部分，访问引用时将产生 RuntimeException。

source: Defines the next view to give focus to when the next focus is View.FOCUS_UP If the reference refers to a view that does not exist or is part of a hierarchy that is invisible, a RuntimeException will result when the reference is accessed.
zh_cn: 定义下一个 view，以便在下一个焦点为 View.FOCUS_UP 如果引用引用的 view 不存在或者是不可见的层次结构的一部分，访问引用时将产生 RuntimeException。

source: Defines the number of characters that the user must type before completion suggestions are displayed in a drop down menu.
zh_cn: 定义在下拉菜单中显示完成建议之前用户必须键入的字符数。

source: Defines the persistence of the drawing cache.
zh_cn: 定义绘制缓存的持久性。

source: Defines the quality of translucent drawing caches.
zh_cn: 定义半透明绘制缓存的质量。

source: Defines the relationship between the ViewGroup and its descendants when looking for a View to take focus.
zh_cn: 在查找要获得焦点的 view 时，定义 ViewGroup 及其后代之间的关系。

source: Defines the secondary progress value, between 0 and max.
zh_cn: 定义次要进度值，介于 0 和最大值之间。

source: Defines the type of strokes that define a gesture.
zh_cn: 定义定义手势的笔划类型。

source: Defines the vertical scrollbar thumb drawable.
zh_cn: 定义垂直滚动条 thumb drawable。

source: Defines the vertical scrollbar track drawable.
zh_cn: 定义垂直滚动条轨道 drawable。

source: Defines whether a child is limited to draw inside of its bounds or not.
zh_cn: 定义是否限制子级在其边界内绘制。

source: Defines whether changes in layout (caused by adding and removing items) should cause a LayoutTransition to run.
zh_cn: 定义布局更改(由添加和移除项引起)是否应导致 LayoutTransition 运行。

source: Defines whether layout animations should create a drawing cache for their children.
zh_cn: 定义布局动画是否应为其子项创建绘制缓存。

source: Defines whether the ViewGroup should always draw its children using their drawing cache or not.
zh_cn: 定义 ViewGroup 是否应始终使用其子 view 绘制缓存绘制。

source: Defines whether the ViewGroup will clip its children and resize (but not clip) any EdgeEffect to its padding, if padding is not zero.
zh_cn: 定义 ViewGroup 在 padding 不为零时，是否剪切其子级并将任何 EdgeEffect 调整大小(但不剪切)到其 padding。

source: Defines whether the animator loops to the first view once it has reached the end of the list.
zh_cn: 定义 animator 到达列表末尾后是否循环到第一个 view。

source: Defines whether the gesture will automatically fade out after being recognized.
zh_cn: 定义手势在被识别后是否会自动淡出。

source: Defines whether the horizontal scrollbar track should always be drawn.
zh_cn: 定义是否应始终绘制水平滚动条轨道。

source: Defines whether the overlay should intercept the motion events when a gesture is recognized.
zh_cn: 定义在识别手势时叠加层是否应截取运动事件。

source: Defines whether the scrollview should stretch its content to fill the viewport.
zh_cn: 定义 scrollview 是否应拉伸其内容以填充视口。

source: Defines whether the vertical scrollbar track should always be drawn.
zh_cn: 定义是否应始终绘制垂直滚动条轨道。

source: Defines whether this view reacts to click events.
zh_cn: 定义此 view 是否对单击事件做出反应。

source: Defines whether this view reacts to context click events.
zh_cn: 定义此 view 是否对上下文单击事件做出反应。

source: Defines whether this view reacts to long click events.
zh_cn: 定义此 view 是否对长按事件做出反应。

source: Defines whether to animate the current View when the ViewAnimation is first displayed.
zh_cn: 定义在首次显示 ViewAnimation 时是否为当前 view 设置动画。

source: Defines whether to fade out scrollbars when they are not in use.
zh_cn: 定义在不使用滚动条时是否淡出滚动条。

source: Defines which edges should be faded on scrolling.
zh_cn: 定义滚动时哪些边应该褪色。

source: Defines which scroll indicators should be displayed when the view can be scrolled.
zh_cn: 定义可以滚动 view 时应显示的滚动指示符。

source: Defines which scrollbars should be displayed on scrolling or not.
zh_cn: 定义滚动时是否应显示哪个滚动条。

source: Defining a FileProvider
zh_cn: 定义一个 FileProvider

source: Denotes that a parameter, field or method return value can be null.
zh_cn: 指示一个参数，字段或方法返回值可以为 null 。

source: Denotes that a parameter, field or method return value can never be null.
zh_cn: 指示一个参数，字段或方法返回值不能为 null 。

source: Denotes that an integer parameter, field or method return value is expected
zh_cn: 指示一个整型参数、字段或方法的返回值，

source: Denotes that an integer parameter, field or method return value is expected to be a String resource reference (e.g. android.R.string.ok).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 String 资源引用 (e.g. android.R.string.ok).

source: Denotes that an integer parameter, field or method return value is expected to be a boolean resource reference.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 boolean 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a color resource reference (e.g.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 color 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a color resource reference (e.g. android.R.color.black).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 color 资源引用 (e.g. android.R.color.black).

source: Denotes that an integer parameter, field or method return value is expected to be a dimension resource reference (e.g.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 dimension 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a dimension resource reference (e.g. android.R.dimen.app_icon_size).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 dimension 资源引用 (e.g. android.R.dimen.app_icon_size).

source: Denotes that an integer parameter, field or method return value is expected to be a drawable resource reference (e.g.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 drawable 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a drawable resource reference (e.g. android.R.attr.alertDialogIcon).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 drawable 资源引用 (e.g. android.R.attr.alertDialogIcon).

source: Denotes that an integer parameter, field or method return value is expected to be a fraction resource reference.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 fraction 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a layout resource reference (e.g. android.R.layout.list_content).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 layout 资源引用 (e.g. android.R.layout.list_content).

source: Denotes that an integer parameter, field or method return value is expected to be a menu resource reference.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 menu 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a plurals resource reference.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 plurals 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a raw resource reference.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 raw 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a resource reference of any type.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个任意类型的资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a style resource reference (e.g. android.R.style.TextAppearance).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 style 资源引用 (e.g. android.R.style.TextAppearance).

source: Denotes that an integer parameter, field or method return value is expected to be a styleable resource reference (e.g. android.R.styleable.TextView_text).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 styleable 资源引用 (e.g. android.R.styleable.TextView_text).

source: Denotes that an integer parameter, field or method return value is expected to be a transition resource reference.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 transition 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an XML resource reference.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 XML 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an anim resource reference (e.g.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 anim 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an anim resource reference (e.g. android.R.anim.fade_in).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 anim 资源引用 (e.g. android.R.anim.fade_in).

source: Denotes that an integer parameter, field or method return value is expected to be an animator resource reference (e.g.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 animator 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an animator resource reference (e.g. android.R.animator.fade_in).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 animator 资源引用 (e.g. android.R.animator.fade_in).

source: Denotes that an integer parameter, field or method return value is expected to be an array resource reference (e.g.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 array 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an array resource reference (e.g. android.R.array.phoneTypes).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 array 资源引用 (e.g. android.R.array.phoneTypes).

source: Denotes that an integer parameter, field or method return value is expected to be an attribute reference (e.g.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 attribute 资源。

source: Denotes that an integer parameter, field or method return value is expected to be an attribute reference (e.g. android.R.attr.action).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 attribute 资源 (e.g. android.R.attr.action).

source: Denotes that an integer parameter, field or method return value is expected to be an id resource reference (e.g. android.R.id.copy).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 id 资源引用 (e.g. android.R.id.copy).

source: Denotes that an integer parameter, field or method return value is expected to be an integer resource reference (e.g. android.R.integer.config_shortAnimTime).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 integer 资源引用 (e.g. android.R.integer.config_shortAnimTime).

source: Denotes that an integer parameter, field or method return value is expected to be an interpolator resource reference (e.g. android.R.interpolator.cycle).
zh_cn: 指示一个整型参数、字段或方法的返回值，预期是一个 interpolator 资源引用 (e.g. android.R.interpolator.cycle).

source: Denotes that an integer parameter, field or method return value is expected to represent a dimension.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期表示一个尺寸。

source: Denotes that an integer parameter, field or method return value is expected to represent a pixel dimension.
zh_cn: 指示一个整型参数、字段或方法的返回值，预期表示一个像素尺寸。

source: Denotes that any overriding methods should invoke this method as well.
zh_cn: 指示任何重写的方法也应该调用该方法。

source: Denotes that the annotated String element, represents a logical
zh_cn: 指示所注解的字符串元素，

source: Denotes that the annotated String element, represents a logical type and that its value should be one of the explicitly named constants.
zh_cn: 指示所注解的字符串元素，表示一个逻辑类型，并且它的值应该是显示指明的常量之一。

source: Denotes that the annotated element of integer type, represents
zh_cn: 指示所注解的整型元素，

source: Denotes that the annotated element of integer type, represents a logical type and that its value should be one of the explicitly named constants.
zh_cn: 指示所注解的整型元素，表示一个逻辑类型，并且它的值应该是显示指明的常量之一。

source: Denotes that the annotated element represents a packed color int, AARRGGBB.
zh_cn: 指示所注解的元素表示一个包装的颜色整型, AARRGGBB.

source: Denotes that the annotated element requires (or may require) one or more permissions.
zh_cn: 指示所注解的元素需要(或可能需要)一个或多个权限。

source: Denotes that the annotated element should be a float or double in the given range
zh_cn: 指示所注解的元素应该是在指定范围内的 float 或 double

source: Denotes that the annotated element should be an int or long in the given range
zh_cn: 指示所注解的元素应该是在指定范围内的 int 或 long

source: Denotes that the annotated element should have a given size or length.
zh_cn: 指示所注解的元素应该有一个给定的尺寸或长度。

source: Denotes that the annotated element should not be removed when
zh_cn: 指示所注解的元素在编译时压缩代码时，不应该被移除。

source: Denotes that the annotated element should not be removed when the code is minified at build time.
zh_cn: 指示所注解的元素在编译时压缩代码时，不应该被移除。

source: Denotes that the annotated element should only be called on the given API level
zh_cn: 指示所注解的元素，只应该在给定的 API 级别或更高级别上调用。

source: Denotes that the annotated element should only be called on the given API level or higher.
zh_cn: 指示所注解的元素，只应该在给定的 API 级别或更高级别上调用。

source: Denotes that the annotated method can be called from any thread (e.g.
zh_cn: 指示所注解的方法可以从任意线程调用。

source: Denotes that the annotated method can be called from any thread (e.g. it is "thread safe".) If the annotated element is a class, then all methods in the class can be called from any thread.
zh_cn: 指示所注解的方法可以从任意线程调用 (e.g. it is "thread safe".) 如果注解的元素是一个类，则类中的所有方法都可以从任意线程调用。

source: Denotes that the annotated method or constructor should only be called on the UI thread.
zh_cn: 指示所注解的方法应该只在 UI 线程被调用。

source: Denotes that the annotated method returns a result that it typically is an error to ignore.
zh_cn: 指示所注解的方法的返回值，如果被忽略通常会出错。

source: Denotes that the annotated method should only be called on a worker thread.
zh_cn: 指示所注解的方法应该只在工作线程被调用。

source: Denotes that the annotated method should only be called on the binder thread.
zh_cn: 指示所注解的方法应该只在绑定线程被调用。

source: Denotes that the annotated method should only be called on the main thread.
zh_cn: 指示所注解的方法应该只在主线程被调用。

source: Denotes that the class, method or field has its visibility relaxed, so that it is more widely
zh_cn: 指示类，方法或字段的可见性放宽，

source: Denotes that the class, method or field has its visibility relaxed, so that it is more widely visible than otherwise necessary to make code testable.
zh_cn: 指示类，方法或字段的可见性放宽，它比必要的可见性更广以使代码更可测试。

source: Density-independent Pixels - An abstract unit that is based on the physical density of the screen.
zh_cn: Density-independent Pixels（密度无关像素） - 一个基于屏幕物理密度的抽象单位

source: Derived classes with children should override this method and call layout on each of their children.
zh_cn: 衍生的有子 view 的类应该重写该方法，并调用每一个子 view 的 layout 方法。

source: Describes how the foreground is positioned.
zh_cn: 描述前景的定位方式。

source: Describes the content of a view so that a autofill service can fill in the appropriate data.
zh_cn: 描述 view 的内容，以便自动填充服务可以填写适当的数据。

source: Describes whether or not this view is important for accessibility.
zh_cn: 描述此 view 对可访问性是否重要。

source: Description
zh_cn: 描述

source: Design For Accessibility
zh_cn: 设计辅助功能

source: Destination image
zh_cn: 目标图像

source: Destination pixels covered by the source are cleared to 0.
zh_cn: 由源像素覆盖的目标像素被清除为 0。

source: Detach a child view and add it to a Recycler's scrap heap.
zh_cn: 分离一个子 view 并且把它添加到 Recycler's 的废弃堆。

source: Detect and diagnose problems
zh_cn: 检测并诊断问题

source: Determinate Progress
zh_cn: 确定进展

source: Determine the current opacity of the scrim behind a given child view
zh_cn: 确定给定子 view 后面的稀松布的当前不透明度

source: Determine whether interaction with views behind the given child in the child order should be blocked.
zh_cn: 确定是否应阻止 child 顺序中给定 child 后面的 view 的交互。

source: Determine whether the supplied child view has another specific sibling view as a layout dependency.
zh_cn: 确定提供的子 view 是否具有另一个特定的兄弟 view 作为布局依赖性。

source: Determines the validity of the supplied LayoutParams object.
zh_cn: 确定提供的 LayoutParams 对象的可用性。

source: Determines whether a page View is associated with a specific key object as returned by instantiateItem(ViewGroup, int).
zh_cn: 确定页面 View 是否与由 instantiateItem(ViewGroup, int) 返回的特定键对象相关联。

source: Determines whether all children, or just those in the VISIBLE or INVISIBLE state, are considered when measuring.
zh_cn: 确定在测量时是否考虑所有子项，或仅处于“可见”或“不可见”状态的子项。

source: Determines whether the strip under the tab indicators is drawn or not.
zh_cn: 确定是否绘制选项卡指示符下的条带。

source: Determines whether to measure all children or just those in the VISIBLE or INVISIBLE state when measuring.
zh_cn: 确定测量时是测量所有子项还是仅测量处于 VISIBLE 或 INVISIBLE 状态的子项。

source: Developer Guide
zh_cn: 开发人员指南

source: Developer Guides
zh_cn: 开发指导

source: Diagnosing slow startup times
zh_cn: 诊断启动时间较慢

source: Diagnosing the problem
zh_cn: 诊断问题

source: Diagrams
zh_cn: 图

source: Did not find a child to receive the event.
zh_cn: 找不到接收事件的子项。

source: Different content insets are often called for when additional buttons are present in the toolbar, as well as at different toolbar sizes.
zh_cn: 当工具栏中存在其他按钮时，以及不同的工具栏大小时，通常会调用不同的内容内缩。

source: Dimension constraints
zh_cn: 尺寸限制

source: Dimension will be controlled by constraints
zh_cn: Dimension 将被约束控制

source: Dimension will be controlled by constraints.
zh_cn: 尺寸将被约束控制。

source: Dimension will set by the view's content
zh_cn: 尺寸将由 view 的内容设置

source: Dimensions constraints
zh_cn: 尺寸约束

source: Directly call any attached OnClickListener.
zh_cn: 直接调用任何附加的 OnClickListener。

source: Disable scrolling on the view.
zh_cn: 禁用 view 上的滚动。

source: Disables the transcript mode.
zh_cn: 禁用 transcript 模式。

source: Disabling the filters is necessary because the system server, not the app itself, serves this log.
zh_cn: 禁用过滤器是必要的，因为系统服务器而不是应用程序本身服务于此日志。

source: Disabling this flag prevents PackageManager from copying .so files from the APK to the filesystem during installation and has the added benefit of making updates of your app smaller.
zh_cn: 禁用此标志可防止 PackageManager 在安装过程中将 .so 文件从 APK 复制到文件系统，并具有额外好处使更新应用程序更小。

source: Discards all destination pixels.
zh_cn: 丢弃所有目标像素。

source: Discards all source pixels.
zh_cn: 丢弃所有源像素。

source: Discards destination pixels that are covered by source pixels.
zh_cn: 丢弃源像素覆盖的目标像素。

source: Discards source pixels that cover destination pixels.
zh_cn: 丢弃覆盖目标像素的源像素。

source: Discards the destination pixels that are not covered by source pixels.
zh_cn: 丢弃未被源像素覆盖的目标像素。

source: Discards the source and destination pixels where source pixels cover destination pixels.
zh_cn: 放弃源像素覆盖目标像素（区域）的源像素和目标像素。

source: Discards the source pixels that do not cover destination pixels.
zh_cn: 丢弃未覆盖目标像素的源像素。

source: Dismiss all currently showing popup menus, including overflow or submenus.
zh_cn: 关闭所有当前显示的弹出菜单，包括溢出或子菜单。

source: Dispatch a fling to a nested scrolling parent before it is processed by this view.
zh_cn: 分发一个 fling 动作给嵌套滚动的 parent，在该动作被当前 view 处理前。

source: Dispatch a fling to a nested scrolling parent.
zh_cn: 分发一个 fling 动作到嵌套的滚动父 view 中。

source: Dispatch one step of a nested scroll in progress before this view consumes any portion of it.
zh_cn: 在滚动过程中，分发嵌套滚动的一步，在该 view 消耗任何一部分之前。

source: Dispatch one step of a nested scroll in progress.
zh_cn: 分发嵌套滚动过程中的一步滚动。

source: Dispatch to touch targets, excluding the new touch target if we already dispatched to it.
zh_cn: 分发到触摸目标，但如果我们已经发送到新的触摸目标，则不包括它。

source: Dispatch to touch targets.
zh_cn: 分发到触摸目标。

source: Display mode for spinner options.
zh_cn: 微调器选项的显示模式。
